In [17]:
import pandas as pd

df = pd.read_csv("data/raw/dataset.csv")

df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,XxYUnited Kingdom☺️
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,ö84406B^,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,&17850.0#,XxYUnited Kingdom☺️
3,536365,84029G,$KNITTED UNION FLAG HOT WATER BOTTLE,6@,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,$RED WOOLLY HOTTIE WHITE HEART.,6@,2010-12-01 08:26:00,3.39,&17850.0#,United Kingdom

In [18]:
df.info()
df.isna().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540884 non-null  object
 3   Quantity     541909 non-null  object
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  object
 6   CustomerID   433909 non-null  object
 7   Country      541909 non-null  object
dtypes: object(8)
memory usage: 33.1+ MB

InvoiceNo           0
StockCode           0
Description      1025
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     108000
Country             0
dtype: int64

In [19]:
df = pd.read_csv("data/raw/dataset.csv", encoding="ISO-8859-1")
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,XxYUnited Kingdomâºï¸
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,Ã¶84406B^,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,&17850.0#,XxYUnited Kingdomâºï¸
3,536365,84029G,$KNITTED UNION FLAG HOT WATER BOTTLE,6@,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,$RED WOOLLY HOTTIE WHITE HEART.,6@,2010-12-01 08:26:00,3.39,&17850.0#,United Kingdom

In [20]:
import re

def clean_stockcode(x):
    if pd.isna(x):
        return x
    return re.sub(r'[^A-Za-z0-9]', '', str(x))

df['StockCode'] = df['StockCode'].apply(clean_stockcode)
df['StockCode'].head()

0    85123A
1     71053
2    84406B
3    84029G
4    84029E
Name: StockCode, dtype: object

In [21]:
df['Quantity'] = df['Quantity'].astype(str).str.replace(r'[^0-9\-]', '', regex=True)
df['Quantity'] = pd.to_numeric(df['Quantity'], errors='coerce')
df['Quantity'].head()

0    6
1    6
2    8
3    6
4    6
Name: Quantity, dtype: int64

In [22]:
df['CustomerID'] = df['CustomerID'].astype(str).str.replace(r'[^0-9]', '', regex=True)
df['CustomerID'] = pd.to_numeric(df['CustomerID'], errors='coerce')
df['CustomerID'].head()

0    178500.0
1    178500.0
2    178500.0
3    178500.0
4    178500.0
Name: CustomerID, dtype: float64

In [23]:
df['Description'] = df['Description'].astype(str).str.replace(r'[^A-Za-z0-9 \-\'\"]', '', regex=True)
df['Description'].head()

0     WHITE HANGING HEART T-LIGHT HOLDER
1                    WHITE METAL LANTERN
2         CREAM CUPID HEARTS COAT HANGER
3    KNITTED UNION FLAG HOT WATER BOTTLE
4          RED WOOLLY HOTTIE WHITE HEART
Name: Description, dtype: object

In [24]:
df['Country'] = df['Country'].astype(str).str.replace(r'[^A-Za-z ]', '', regex=True)
df['Country'].head()

0    XxYUnited Kingdom
1       United Kingdom
2    XxYUnited Kingdom
3       United Kingdom
4       United Kingdom
Name: Country, dtype: object

In [25]:
# Final clean-up for Country column
df['Country'] = df['Country'].str.replace(r'[^A-Za-z ]', '', regex=True).str.strip()

df['Country'].unique()[:10]

array(['XxYUnited Kingdom', 'United Kingdom', 'France', 'XxYFrance',
       'XxYAustralia', 'Australia', 'XxYNetherlands', 'Netherlands',
       'XxYGermany', 'Germany'], dtype=object)

In [26]:
df['Country'] = df['Country'].str.replace(r'^[A-Za-z]{2,4}(?=[A-Z])', '', regex=True).str.strip()

In [27]:
df['Country'] = df['Country'].str.replace(r'^[A-Za-z]{2,4}(?=[A-Z])', '', regex=True).str.strip()

df['Country'].unique()

array(['United Kingdom', 'France', 'Australia', 'Netherlands', 'Germany',
       'Norway', 'E', 'Switzerland', 'Spain', 'Poland', 'Portugal',
       'Italy', 'Belgium', 'Lithuania', 'Japan', 'Iceland',
       'Channel Islands', 'Denmark', 'Cyprus', 'Sweden', 'Austria',
       'Israel', 'Finland', 'Bahrain', 'Greece', 'Hong Kong', 'Singapore',
       'Lebanon', 'United Arab Emirates', 'Saudi Arabia',
       'Czech Republic', 'Canada', 'Unspecified', 'Brazil', 'SA', 'A',
       'European Community', 'Malta'], dtype=object)

In [28]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,178500.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,178500.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,178500.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,178500.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART,6,2010-12-01 08:26:00,3.39,178500.0,United Kingdom

### Initial Findings from Data Exploration

- The `Country` column contained unexpected prefixes (e.g., `XxYUnited Kingdom`).
- These prefixes followed a pattern of 2–4 uppercase/lowercase letters attached directly to the country name.
- No numeric or special-character contamination was found—just unwanted alphabetic prefixes.
- A regex rule was applied to remove the prefix while keeping the valid country name intact.
- After cleaning, the `Country` column contained only standard country names (e.g., United Kingdom, France, Germany).

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  541909 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  object
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(1), int64(1), object(6)
memory usage: 33.1+ MB

In [30]:
# Convert InvoiceDate column to datetime
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'], errors='coerce')

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  541909 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  object
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 33.1+ MB

In [32]:
df[pd.to_numeric(df['UnitPrice'], errors='coerce').isna()].head(10)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
6,536365Ã¤,21730,GLASS STAR FROSTED T-LIGHT HOLDER,6,2010-12-01 08:26:00,Ww4.25,178500.0,United Kingdom
10,536367,22745,POPPY'S PLAYHOUSE BEDROOM,6,2010-12-01 08:34:00,Ww2.1,130470.0,United Kingdom
13,536367Ã¤,22310,IVORY KNITTED MUG COSY,6,2010-12-01 08:34:00,Ww1.65,130470.0,United Kingdom
25,536369Ã¤,21756,BATH BUILDING BLOCK WORD,3,2010-12-01 08:35:00,Ww5.95,130470.0,United Kingdom
30,536370,21883,STARS GIFT TAPE,24,2010-12-01 08:45:00,Ww0.65,125830.0,France
35,536370,22629,SPACEBOY LUNCH BOX,24,2010-12-01 08:45:00,Ww1.95,125830.0,France
43,536370Ã¤,22544,MINI JIGSAW SPACEBOY,24,2010-12-01 08:45:00,Ww0.42,125830.0,France
47,536372Ã¤,22632,HAND WARMER RED POLKA DOT,6,2010-12-01 09:01:00,Ww1.85,178500.0,United Kingdom
60,536373,82494L,WOODEN FRAME ANTIQUE WHITE,6,2010-12-01 09:02:00,Ww2.55,178500.0,United Kingdom
71,536375Ã¤,21871,SAVE THE PLANET MUG,6,2010-12-01 09:32:00,Ww1.06,178500.0,United Kingdom

In [33]:
# Remove "Ww" prefix and convert to numeric
df['UnitPrice'] = df['UnitPrice'].astype(str).str.replace('Ww', '', regex=False)
df['UnitPrice'] = pd.to_numeric(df['UnitPrice'], errors='coerce')

In [34]:
df[pd.to_numeric(df['UnitPrice'], errors='coerce').isna()].head()

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country]
Index: []

In [35]:
df.duplicated().sum()
df[df['Quantity'] < 0].head()
df[df['UnitPrice'] <= 0].head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
622,536414Ã¤,22139,nan,56,2010-12-01 11:52:00,0.0,NaN,United Kingdom
1970,536545,21134,nan,1,2010-12-01 14:32:00,0.0,NaN,United Kingdom
1971,536546Ã¤,22145,nan,1,2010-12-01 14:33:00,0.0,NaN,United Kingdom
1972,536547,37509,nan,1,2010-12-01 14:33:00,0.0,NaN,United Kingdom
1987,536549,85226A,nan,1,2010-12-01 14:34:00,0.0,NaN,United Kingdom

In [36]:
# Remove invalid prices
df = df[df['UnitPrice'] > 0]

# Remove invalid quantities (keep only positive sold items)
df = df[df['Quantity'] > 0]

# Drop duplicates
df = df.drop_duplicates()

# Drop rows missing CustomerID (optional, but improves quality)
df = df.dropna(subset=['CustomerID'])

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 395190 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    395190 non-null  object
 1   StockCode    395190 non-null  object
 2   Description  395190 non-null  object
 3   Quantity     395190 non-null  int64
 4   InvoiceDate  395190 non-null  datetime64[ns]
 5   UnitPrice    395190 non-null  float64
 6   CustomerID   395190 non-null  float64
 7   Country      395190 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 27.1+ MB

In [38]:
# Final clean-up for InvoiceNo: keep only digits
df['InvoiceNo'] = (
    df['InvoiceNo']
    .astype(str)
    .str.extract(r'(\d+)', expand=False)  # grabs only the numeric part
)

In [39]:
df['InvoiceNo'].head()
df['InvoiceNo'].str.contains(r'[^0-9]', regex=True).sum()  # should be 0

0

In [40]:
df.to_csv("data/processed/cleaned_data.csv", index=False)